package by.javaguru.module01.part07.task05;

public class Solution {
    /*
    Массивы

    1. Получить через Scanner размер тестового массива
    2. Заполнить массив случайными целочисленными значениями
    3. Написать метод, удаляющий из массива локальные максимумы.
    4. Вывести на экран изначальный массив и массив после удаления локальных
    максимумов с помощью метода Arrays.toString(array).
    Локальный максимум - элемент, который больше предыдущего и следующего, если
    элемент стоит в начале или в конце массива, то больше только следующего или только
    предыдущего соответственно.
    Пример:
    Изначальный массив: [5, 3, -10, 4, -4, 80, 20].
    Поcле удаления локальных максимумов: [3, -10, -4, 20]
    */

    public static void main(String[] args) {

    }

}
